football_frenzy_api/app/controllers/players_controller.rb

SELECT "players".* FROM "players"
---
  def index
    @players = Player.all

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @player = Player.find(params[:id])

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "players" SET "team_id" = $1, "updated_at" = $2 WHERE "players"."id" = $3  [["team_id", 25], ["updated_at", "2019-06-03 15:18:46.495082"], ["id", 1]]
---
  def update
      @player = Player.find(params[:id])
      @player.update(player_params)