football_frenzy_api/app/controllers/teams_controller.rb

INSERT INTO "teams" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Why"], ["created_at", "2019-06-03 15:11:30.179249"], ["updated_at", "2019-06-03 15:11:30.179249"]]
---
  def create
    @team = Team.create(create_team_params)

SELECT "players".* FROM "players" WHERE "players"."team_id" = $1  [["team_id", 2]]
SELECT "teams".* FROM "teams"
---
  def index
    @player = Player.find(params[:player_id])
    @teams = Team.all

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
---
  def show
    @player = Player.find(params[:player_id])
    @team = Team.find(params[:id])

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "teams" SET "qb" = $1, "updated_at" = $2 WHERE "teams"."id" = $3  [["qb", "me"], ["updated_at", "2019-06-03 15:16:05.849824"], ["id", 1]]
---
  def update
    @team = Team.find(params[:id])
    @team.update(update_team_params)

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
DELETE FROM "teams" WHERE "teams"."id" = $1  [["id", 25]]
---
  def destroy
    @team = Team.find(params[:id])
    @team.destroy