football_frenzy_api/app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("email", "password", "commish", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "test@test.com"], ["password", "hello"], ["commish", true], ["created_at", "2019-06-02 23:34:21.800013"], ["updated_at", "2019-06-02 23:34:21.800013"]]

  def index
    @league = League.find(params[:league_id])
    @team = Team.find(params[:team_id])
    @users = User.all
---
SELECT "users".* FROM "users"